# 超过 9 / 10 后面的内容做截取判断

filter_header = {
	"大家好":1,
	"为防止":1,
	"看不到我们":1,
	"请务必":1,
	"点击上方":1,
	"右上角菜单":1,
	"设为星标":1,
    "亲身实践":1,
	"关注后":1,
	"方蓝色字体":1,
	"公众号":1,
	"二维码":1,
	"扫一扫":1,
	"扫码关注":1,
	"下一期":1,
	"阅读原文":1,
	"关注我们":1,
	"回复对应的电影":1,
}

filter_words = {
	"为防止":1,
	"看不到我们":1,
	"请务必":1,
	"点击上方":1,
	"右上角菜单":1,
	"设为星标":1,
	"底部阅读原文":1,
	"公众号内":1,
	"回复片名":1,
	"不可抗力":1,
	"与大家失联":1,
	"关注一下":1,
    "tips":1,
    "精选":1,
    "亲身实践":1,
	"关注后":1,
	"方蓝色字体":1,
	"公众号":1,
	"二维码":1,
	"扫一扫":1,
	"扫码关注":1,
	"下一期":1,
	"阅读原文":1,
	"关注我们":1,
	"回复对应的电影":1,
	"回复电影":1,
	"来源：":1,
	"长按识别":1,
	"查看更多":1,
	"编辑":1,
	"作者":1,
	"来微博":1,
	"免费看电影":1,
	"点击关注":1,
	"上方蓝字":1,
}


filter_title = {
	"《":1,
	"》":1,
	"HD":1,
	"双语": 1,
	"国泰": 1,
	"【":1,
	"】":1,
}

# 最后10行文字，遇到 stop
filter_footer = {
	"为防止": 1,
	"看不到我们": 1,
	"请务必": 1,
	"点击上方": 1,
	"右上角菜单": 1,
	"设为星标": 1,
	"底部阅读原文": 1,
	"公众号内": 1,
	"回复片名": 1,
	"不可抗力": 1,
	"转载":1,
	"公众号": 1,
	"二维码": 1,
	"扫一扫": 1,
	"扫码关注": 1,
	"下一期": 1,
	"阅读原文": 1,
	"关注我们": 1,
	"回复对应的电影": 1,
	"回复电影": 1,
	"电影名称": 1,
	"来源：": 1,
	"长按识别": 1,
	"查看更多": 1,
	"编辑": 1,
	"作者": 1,
	"24小时过级计划": 1,
}

def exist_head(s)->bool:
	for w in filter_header:
		if w in s:
			return True

	return False

def exist_word(s)->bool:
	for w in filter_words:
		if w in s:
			return True

	return False


def footer_filter_pass(s) -> bool:
	for w in filter_footer:
		if w in s:
			return False

	return True


def title_filter_pass(title)->bool:
	for w in filter_title:
		if w in title:
			return False

	return True
